colophon.html
---
layout: default
title: Colophon
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5449a2d">Creating site content</a></li>
<li><a href="#org79e3e0f">Generating the site</a></li>
<li><a href="#org7ddd297">Serving the site</a></li>
<li><a href="#orgbac78a7">Languages used</a></li>
</ul>
</div>
</div>

<p>
All of the content on this site is either my work or is in the public
domain. I designed and implemented the user interface and style
myself.
</p>

<p>
To make this project easier, and serve the website to you, I used a
stack of excellent tools.
</p>

<div id="outline-container-org5449a2d" class="outline-2">
<h2 id="org5449a2d">Creating site content</h2>
<div class="outline-text-2" id="text-org5449a2d">
</div>
<div id="outline-container-orgf5c8175" class="outline-3">
<h3 id="orgf5c8175">GNU Emacs</h3>
<div class="outline-text-3" id="text-orgf5c8175">
<p>
In my opinion, the greatest text editor / integrated development
environment ever created. Finely honed and infinitely customizable.
</p>
</div>
</div>

<div id="outline-container-org2805eb8" class="outline-3">
<h3 id="org2805eb8">Org Mode</h3>
<div class="outline-text-3" id="text-org2805eb8">
<p>
A feature filled hierarchical document creation system for Emacs, and
the closest to perfect to do management you can get.
</p>
</div>
</div>

<div id="outline-container-orgf933192" class="outline-3">
<h3 id="orgf933192">GIMP</h3>
<div class="outline-text-3" id="text-orgf933192">
<p>
High quality image editor and converter, used to alter or touch up
many of the images I use on the site.
</p>
</div>
</div>

<div id="outline-container-orgf75a047" class="outline-3">
<h3 id="orgf75a047">Vivaldi</h3>
<div class="outline-text-3" id="text-orgf75a047">
<p>
Great browser based on Chromium, used to assess the appearance of the
site and debug the interactions between HTML, CSS, and JS.
</p>
</div>
</div>
</div>

<div id="outline-container-org79e3e0f" class="outline-2">
<h2 id="org79e3e0f">Generating the site</h2>
<div class="outline-text-2" id="text-org79e3e0f">
</div>
<div id="outline-container-orga92b5c6" class="outline-3">
<h3 id="orga92b5c6">GNU Make</h3>
<div class="outline-text-3" id="text-orga92b5c6">
<p>
Extremely flexible system for creating recipes to build software. Used
to condense the Org to HTML conversion into one command.
</p>
</div>
</div>

<div id="outline-container-orge4c2d00" class="outline-3">
<h3 id="orge4c2d00">GNU Emacs</h3>
<div class="outline-text-3" id="text-orge4c2d00">
<p>
Used as an Emacs Lisp interpreter, running the functions required to
have all my source files converted into HTML for Jekyll.
</p>
</div>
</div>

<div id="outline-container-org3841e00" class="outline-3">
<h3 id="org3841e00">Org Mode</h3>
<div class="outline-text-3" id="text-org3841e00">
<p>
Provides a fantastic HTML exporter and publisher, used to create the
body HTML of every page on the site, and a sitemap as well.
</p>
</div>
</div>

<div id="outline-container-org9c0857a" class="outline-3">
<h3 id="org9c0857a">Jekyll</h3>
<div class="outline-text-3" id="text-org9c0857a">
<p>
Static site and blog creation system; uses my layouts and stylesheet,
and the bodies created by Org mode, to generate the site's final form.
</p>
</div>
</div>
</div>

<div id="outline-container-org7ddd297" class="outline-2">
<h2 id="org7ddd297">Serving the site</h2>
<div class="outline-text-2" id="text-org7ddd297">
</div>
<div id="outline-container-org6b210fa" class="outline-3">
<h3 id="org6b210fa">Git</h3>
<div class="outline-text-3" id="text-org6b210fa">
<p>
Universally used version control system, handles tracking changes and
pushing site updates to GitHub.
</p>
</div>
</div>

<div id="outline-container-org33f7e36" class="outline-3">
<h3 id="org33f7e36">Magit</h3>
<div class="outline-text-3" id="text-org33f7e36">
<p>
Fantastic interface to Git from within Emacs. Provides convenient
keybindings and useful information for all version control tasks.
</p>
</div>
</div>

<div id="outline-container-orge6ea77e" class="outline-3">
<h3 id="orge6ea77e">Jekyll</h3>
<div class="outline-text-3" id="text-orge6ea77e">
<p>
Integrated into GitHub, generates my site in the production
environment so that it can be served to you.
</p>
</div>
</div>

<div id="outline-container-org5c62d26" class="outline-3">
<h3 id="org5c62d26">GitHub</h3>
<div class="outline-text-3" id="text-org5c62d26">
<p>
Free hosting of source repositories and static sites alike; simply the
best option available for this site.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbac78a7" class="outline-2">
<h2 id="orgbac78a7">Languages used</h2>
<div class="outline-text-2" id="text-orgbac78a7">
</div>
<div id="outline-container-org75026ef" class="outline-3">
<h3 id="org75026ef">HTML5</h3>
<div class="outline-text-3" id="text-org75026ef">
<p>
HyperText Markup Language, the standard Internet markup language.
</p>
</div>
</div>

<div id="outline-container-orgeaffa9e" class="outline-3">
<h3 id="orgeaffa9e">CSS3</h3>
<div class="outline-text-3" id="text-orgeaffa9e">
<p>
Cascading Style Sheets, the standard Internet styling language.
</p>
</div>
</div>

<div id="outline-container-org2b75ae2" class="outline-3">
<h3 id="org2b75ae2">JavaScript</h3>
<div class="outline-text-3" id="text-org2b75ae2">
<p>
The standard Internet scripting language.
</p>
</div>
</div>

<div id="outline-container-orgbcec2cd" class="outline-3">
<h3 id="orgbcec2cd">Liquid</h3>
<div class="outline-text-3" id="text-orgbcec2cd">
<p>
Jekyll's template language; enables dynamic generation of static
content.
</p>
</div>
</div>

<div id="outline-container-org966fe66" class="outline-3">
<h3 id="org966fe66">YAML</h3>
<div class="outline-text-3" id="text-org966fe66">
<p>
Markup language used for Jekyll configuration, like setting sitewide
variables.
</p>
</div>
</div>

<div id="outline-container-orgd551854" class="outline-3">
<h3 id="orgd551854">Emacs Lisp</h3>
<div class="outline-text-3" id="text-orgd551854">
<p>
Lisp dialect which describes much of Emacs functionality. Used to
write directives for the Org mode publisher.
</p>
</div>
</div>

<div id="outline-container-org677f92d" class="outline-3">
<h3 id="org677f92d">Makefile</h3>
<div class="outline-text-3" id="text-org677f92d">
<p>
Simple declarative language used to automate software builds.
</p>
</div>
</div>

<div id="outline-container-org49cfa30" class="outline-3">
<h3 id="org49cfa30">Zsh</h3>
<div class="outline-text-3" id="text-org49cfa30">
<p>
Extension of the Bourne again shell, used for scripting.
</p>
</div>
</div>

<div id="outline-container-orgfb601c7" class="outline-3">
<h3 id="orgfb601c7">English</h3>
<div class="outline-text-3" id="text-orgfb601c7">
<p>
Germanic language written with a simple alphabet. Used to express
ideas to others.
</p>
</div>
</div>
</div>
